#Задача 2. Вариант 11.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, 
#автором которого является О. Генри. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Лохина Л.М.
#12.03.2016

print ('''                         Любовь и поступки
Человек может делать смешные вещи, но от этого он не становится смешным в глазах девушки, ради которой он их делает.  
                                                            О.Генри''')


input ("\n\nНажмите Enter для завершения")
